{"title":"Dead Cells","backgroundImage":"\/\/images-1.gog-statics.com\/3dc6e2c7267288c179ba9b452620de4e375d5e8247795db44b678a4f387b4159","cdKey":"","textInformation":"","downloads":[["English",{"windows":[{"manualUrl":"\/downloads\/dead_cells\/en1installer0","name":"Dead Cells","version":"1.12.4","date":"","size":"0.9 GB"},{"manualUrl":"\/downloads\/dead_cells\/en1patch0","name":"Patch (1.1.12 to 1.2.10)","version":"1.2.10","date":"","size":"518 MB"},{"manualUrl":"\/downloads\/dead_cells\/en1patch1","name":"Patch (0.8.2 to 0.9.2)","version":"0.9.2","date":"","size":"44 MB"},{"manualUrl":"\/downloads\/dead_cells\/en1patch2","name":"Patch (0.8.1 to 0.8.2)","version":"0.8.2","date":"","size":"4 MB"},{"manualUrl":"\/downloads\/dead_cells\/en1patch3","name":"Patch (0.7.9 to 0.8.1)","version":"0.8.1","date":"","size":"33 MB"}],"mac":[{"manualUrl":"\/downloads\/dead_cells\/en2installer0","name":"Dead Cells","version":"1.12.4","date":"","size":"0.8 GB"}],"linux":[{"manualUrl":"\/downloads\/dead_cells\/en3installer0","name":"Dead Cells","version":"1.12.4","date":"","size":"0.8 GB"}]}]],"galaxyDownloads":[],"extras":[],"dlcs":[{"title":"Dead Cells: The Bad Seed","backgroundImage":"\/\/images-2.gog-statics.com\/8c5350a651e706f7c99ed3c844d288f151d1cbeed44c609afb9c285a79e31115","cdKey":"","textInformation":"","downloads":[["English",{"windows":[{"manualUrl":"\/downloads\/dead_cells_the_bad_seed\/en1installer0","name":"DLC","version":"1.12.4","date":"","size":"5 MB"}],"mac":[{"manualUrl":"\/downloads\/dead_cells_the_bad_seed\/en2installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}],"linux":[{"manualUrl":"\/downloads\/dead_cells_the_bad_seed\/en3installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}]}]],"galaxyDownloads":[],"extras":[],"dlcs":[],"tags":[],"isPreOrder":false,"releaseTimestamp":1581429240,"messages":[],"changelog":"","forumLink":"https:\/\/embed.gog.com\/forum\/dead_cells","isBaseProductMissing":false,"missingBaseProduct":null,"features":["Achievements","Cloud saves","Overlay"],"simpleGalaxyInstallers":[]},{"title":"Dead Cells: Rise of the Giant","backgroundImage":"\/\/images-3.gog-statics.com\/2c654312d914f2f6b6c97a509cba5ec3673136219c14687e8810e2bbee7a3b58","cdKey":"","textInformation":"","downloads":[["English",{"windows":[{"manualUrl":"\/downloads\/dead_cells_rise_of_the_giant\/en1installer0","name":"DLC","version":"1.12.4","date":"","size":"4 MB"}],"mac":[{"manualUrl":"\/downloads\/dead_cells_rise_of_the_giant\/en2installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}],"linux":[{"manualUrl":"\/downloads\/dead_cells_rise_of_the_giant\/en3installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}]}]],"galaxyDownloads":[],"extras":[],"dlcs":[],"tags":[],"isPreOrder":false,"releaseTimestamp":1553799600,"messages":[],"changelog":"","forumLink":"https:\/\/embed.gog.com\/forum\/dead_cells","isBaseProductMissing":false,"missingBaseProduct":null,"features":["Achievements","Cloud saves","Overlay"],"simpleGalaxyInstallers":[]},{"title":"Dead Cells: Fatal Falls","backgroundImage":"\/\/images-4.gog-statics.com\/fc8c90359c79a5521a867f494441ba406303882307d60da91d176f8eebceb175","cdKey":"","textInformation":"","downloads":[["English",{"windows":[{"manualUrl":"\/downloads\/dead_cells_fatal_falls\/en1installer0","name":"DLC","version":"1.12.4","date":"","size":"5 MB"}],"linux":[{"manualUrl":"\/downloads\/dead_cells_fatal_falls\/en3installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}],"mac":[{"manualUrl":"\/downloads\/dead_cells_fatal_falls\/en2installer0","name":"DLC","version":"1.12.4","date":"","size":"1 MB"}]}]],"galaxyDownloads":[],"extras":[],"dlcs":[],"tags":[],"isPreOrder":false,"releaseTimestamp":1611679800,"messages":[],"changelog":"","forumLink":"https:\/\/embed.gog.com\/forum\/dead_cells","isBaseProductMissing":false,"missingBaseProduct":null,"features":["Achievements","Cloud saves","Overlay"],"simpleGalaxyInstallers":[]}],"tags":[],"isPreOrder":false,"releaseTimestamp":1510581000,"messages":[],"changelog":"\u003Cp\u003E\u003Ca href=\u0022https:\/\/dead-cells.com\/patchnotes\u0022\u003Ehttps:\/\/dead-cells.com\/patchnotes\u003C\/a\u003E\u003C\/p\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.5.6 - Corrupted Update (07 November 2019)\u003C\/h4\u003E\n\u003Ch5\u003EBalances paths and biomes, add 1 new meta upgrade, 1 new rune, 3 new tactic mutations and 1 new challenge biome.\u003C\/h5\u003E\n\u003Cp\u003EHello everyone,\u003C\/p\u003E\n\u003Cp\u003EWe\u0027re super stoked to announce that our fifteen update has just reached live. You can find the full patch notes here, but I will give you a rundown of the main additions brought by the Corrupted Update.\u003C\/p\u003E\n\u003Cp\u003EAlternatively, if you prefer watching to reading, there is the 5 minutes vlog linked above showing the fancy new things in action and explaining our reasoning behind the changes.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/www.youtube.com\/watch?v=JSh_8aUYUr4\u0022\u003Ehttps:\/\/www.youtube.com\/watch?v=JSh_8aUYUr4\u003C\/a\u003E\u003C\/p\u003E\n\u003Ch5\u003ENew Content:\u003C\/h5\u003E\n\u003Ch5\u003ENew challenge, optional, biome:\u003C\/h5\u003E\n\u003Cp\u003EThe Corrupted Confinement, which mirrors the Prison Depths. You can access it from the Toxic Sewers, and it will lead to either the Ancient Sewers or the Ramparts (BC1 door). This biome is very short compared to the others, and has a guaranteed cursed chest at the beginning. Prison Depths structure has also been updated to be similar. Beware of the blue birds, they ain\u0027t kidding around.\u003C\/p\u003E\n\u003Ch5\u003ENew Meta upgrade:\u003C\/h5\u003E\n\u003Cp\u003EGiven as a reward for beating the Hand of the King in BC1, the Recycling Tubes replaces the random starting gear. Instead, you will get the choice in-between 4 sets of 5 items (Melee weapon, Range Weapon, Shield and 2 skills). Choose wisely.\u003C\/p\u003E\n\u003Ch5\u003ENew Rune:\u003C\/h5\u003E\n\u003Cp\u003EExplorer Instinct reveals the point of interests on the map once you\u0027ve explored the majority of the level. It will help you if you\u0027re like us and can\u0027t stand to let a tiny bit of a platform unexplored, and regularly waste time backtracking only to find... nothing.\u003C\/p\u003E\n\u003Ch5\u003E3 new Tactic Mutations:\u003C\/h5\u003E\n\u003Cp\u003ECrow\u0027s foot allows you to let caltrops behind you when you roll, slowing and damaging the enemies. Tactical Retreat slows all enemies around you on a perfect dodge. They also won\u0027t be able to inflict you Malaise during a few seconds. Finally, Networking make all the mobs with projectiles stuck in them share damage.\u003C\/p\u003E\n\u003Ch5\u003EBalancing:\u003C\/h5\u003E\n\u003Cp\u003EWhile adding new content to the game is always great, The Corrupted Update is actually mainly an overall balance of the biomes and paths. With these new changes, we try to prevent a biome or a road to become a clear unquestionable better choice than its counterparts. To this end, all biome difficulty and scrolls count has been balanced.\u003C\/p\u003E\n\u003Cp\u003EWe\u0027ve also drastically reduced the amount of cursed chests in the higher difficulty levels, but we\u0027ve also buffed the colorless weapons by making it scales with your forge tiers (no more thousands of golds wasted to improve it to S-quality) as well as making the bonus stats always be of your main color.\u003C\/p\u003E\n\u003Cp\u003EThe decision to removed lots of cursed chests was mainly motivated by having to prevent the colorless weapon from making the color system irrelevant if they were too common (remember the 1.1 legendaries?) but also because we think too much cursed chests kinda spoil the uniqueness of what\u0027s supposed to be very tense moments. And it does encourages scouting, cheesing and backtracking, which can be cool but also break the momentum of the run and lengthen its duration.\u003C\/p\u003E\n\u003Cp\u003EWe added fragments of scrolls to be found in biomes to make up for the loss of the stats points that were brought by the cursed chests, and adjusted the health of bosses to make sure you don\u0027t spend 10 minutes in a tedious fight against them. The curve should be more coherent now, with an easier beginning thanks to the new meta upgrade but a slightly more difficult mid game (compared to before where every mobs were one-shoted).\u003C\/p\u003E\n\u003Cp\u003EWe hope that the changes will please you, but in any case, don\u0027t hesitate to let us know.\u003C\/p\u003E\n\u003Cp\u003ENow, a quick announcement to end up this news! We have partnered with Level 99 Games to add the Beheaded to Exceed, a super cool card game inspired by fighting video games. We really hope our little guy will be completely overpowered compared to the other fighters available, but Level 99 isn\u0027t bad at balancing its roster, so the hope is thin.\u003C\/p\u003E\n\u003Cp\u003EAll the art was done by David Thor Fjalarsson, who also did the key art for the Corrupted Update!\u003C\/p\u003E\n\u003Cp\u003EIf you\u0027re interested, you will be able to buy it here: \u003Ca href=\u0022https:\/\/www.level99games.com\/shop\/the-beheaded-solo-fighter\u0022\u003Ehttps:\/\/www.level99games.com\/shop\/the-beheaded-solo-fighter\u003C\/a\u003E or here: \u003Ca href=\u0022https:\/\/www.level99games.com\/shop\/solo-fighter-bundle\u0022\u003Ehttps:\/\/www.level99games.com\/shop\/solo-fighter-bundle\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003ECheers,\nEE and the MT team. \u003C\/p\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.4.0 (13 August 2019)\u003C\/h4\u003E\n\u003Cp\u003EFull changelog available here: \u003Ca href=\u0022https:\/\/dead-cells.com\/patchnotes\u0022\u003Ehttps:\/\/dead-cells.com\/patchnotes\u003C\/a\u003E\u003C\/p\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.3.7\u003C\/h4\u003E\n\u003Cp\u003EFull changelog available here: \u003Ca href=\u0022https:\/\/dead-cells.com\/patchnotes\u0022\u003Ehttps:\/\/dead-cells.com\/patchnotes\u003C\/a\u003E\u003C\/p\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.2.10 (28 March 2019)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe Custom Mode is now unlocked by beating a mini-boss in Prison Roofs.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Food drop was rebalanced:\n– you now have 100% chance to have 1 unit on mobs and 1 unit hidden in walls in every levels,\n– one food unit dropped by mobs is guaranteed to be clear from Infection,\n– food sold by shops is now always clean.\u003C\/li\u003E\n\u003Cli\u003EThe free “Rise of the Giant” DLC is now required to access to the Cavern and the hidden level.\u003C\/li\u003E\n\u003Cli\u003EThe content of the “Rise of the Giant” DLC is now available in all supported languages.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECommunity suggestion Legendary altars can no longer shield elites.\u003C\/li\u003E\n\u003Cli\u003EElite “Cage” skill is now slightly larger but also inflicts slightly more damage.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Flask refills bought from shops received a permanent 40% discount.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Mobs will now be locked for a longer time after a BC4 teleportation (no more “instant attack after - teleportation”).\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Mob teleportation now interrupts elite skills like “Cage” or “Electric Field”.\u003C\/li\u003E\n\u003Cli\u003EElite skill “Cage” can no longer charge if the mob can’t see the player.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Reduced KunaiMaster overall damage.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Reduced Failed Experiment big guy thing damage.\u003C\/li\u003E\n\u003Cli\u003EKunaiMaster shooting range was divided by 3.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECommunity suggestion Fixed lore rooms generated before the middle gate in Fog Fjord.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EPolish on the Quarry – Added glow on chains in the Cemetery.\u003C\/li\u003E\n\u003Cli\u003EStronger Toxic cloud fx\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion BC4 mob teleportation now displays briefly a “ghost shade” of the mob who is about to teleport.\u003C\/li\u003E\n\u003Cli\u003ECamera now aims higher when climbing on walls\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed abnormal CPU usage on some items (like Ice shards or Decoy)\u003C\/li\u003E\n\u003Cli\u003EFixed crash in lava\u003C\/li\u003E\n\u003Cli\u003EFixed elite shrine massive glow on save\/reload a run\u003C\/li\u003E\n\u003Cli\u003EFixed crash when you die in lava.\u003C\/li\u003E\n\u003Cli\u003EThornies are no longer allowed to teleport while rolling over your face.\u003C\/li\u003E\n\u003Cli\u003EFixed Knight Corpse always giving the blueprint\u003C\/li\u003E\n\u003Cli\u003EFixed Giant skip\u003C\/li\u003E\n\u003Cli\u003EMinor CPU optimizations with some weapons \u0026amp; mobs.\u003C\/li\u003E\n\u003Cli\u003EFixed a few crashes.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.1.12 (05 February 2019)\u003C\/h4\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed language mod upload\u003C\/li\u003E\n\u003Cli\u003EUpdated some texts translations\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUdate 1.1.10 (22 December 2018)\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EA vast number of items have been updated to make them more useful or powerful. The idea here was to make many \u0026quot;auto-recycle\u0026quot; items much more interesting.\u003C\/li\u003E\n\u003Cli\u003ENew custom game mode released! You can now customize your runs the way you want, like unlocking\/relocking items, enabling special gameplay adjustments, changing rules etc. You are under control, have fun :)\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Homunculus skill has been vastly improved: you can now grab your own turrets, cancel a grab, it deals more damage, breaks invisibility etc.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Most mutations have been reworked \u0026amp; balanced in order to make some of them more useful. See other notes for more details.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion The \u0026quot;mob auto-scaling\u0026quot; mechanic has been removed completely. All the levels now have a fixed \u0026quot;difficulty\u0026quot; that won\u0027t adapt to you in weird ways anymore. This affects the game in the following ways: \u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E-- in 0-cell mode: things will be a little bit easier (just a little bit)\n-- in 1 \u0026amp; 2-cells modes: difficulty is roughly the same as before\n-- in 3 \u0026amp; 4-cells modes: you\u0027ll have to be really careful to be properly equipped before getting to late levels (picking cursed chests scrolls is highly recommended) \u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion All the cooldown reduction mechanic has been redone from scratch. The mutations that granted free CD reduction (for active skills and grenades) were removed. They were replaced by 4 new mutations to give you new active ways to reduce your skill cooldowns: by killing enemies in close combat, by killing at distance, by parrying and by dealing critical hits. \u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EFor example, one of these mutations reduces all your ongoing skills cooldowns by 2.5 sec for each successful shield parry, and this time value even increases based on your Survival stat. \u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EThe one that reduces CD for each critical hit is a new colorless mutation that will scale on your highest stat.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Bosses no longer drop Legendary items, but 1 weapon and 1 active skill instead. Legendaries are now \u0026quot;world drop\u0026quot;, so you may encounter them when killing mobs or on the new \u0026quot;legendary altars\u0026quot;. The level generator has also been adjusted to ensure you find a \u0026quot;Legendary Altar\u0026quot; in most of your runs. You may also get legendaries as rewards of advanced challenges, like beating a boss without getting hit.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Damage Reduction has been heavily reworked. Most items no longer grant DR anymore, their power has been increased as a compensation. Damage Reduction is not a mandatory strategy anymore and the whole game difficulty has been rebalanced accordingly.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion You can upgrade the Forge with the Collector and unlock the ability to upgrade an item quality more than once.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Balanced the way money profits\/costs scale on higher difficulty settings. Costs now scale faster than profits. Also, Recycling profits are no longer based on the the buying cost of the item, but on its reselling value, which scales slower (TLDR; recycling no longer breaks the whole economy).\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ENew secret holes can now spawn below your feet. Pay attention to hidden runes in the ground and use your stomp move to break them!\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EMost mobs in 4-cells difficulty are now more aggressive: they can teleport, they have a better detection range and they cannot be distracted by deployed traps.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion New challenge doors in transition levels will require you to kill X enemies without getting hit in a row. Their rewards are equivalent to Timed Doors. Note you can get hit before or after a serie of X kills, this won\u0027t invalidate this challenge.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ENew challenge doors after bosses will grant Legendary items if you kill a Boss without getting hit once.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Timed doors have all been moved to transition levels. They now offer a multi-purpose reward instead of Scrolls. You can now choose 1 reward for free among 3 (picked among weapons, skills and talismans). Their quality level (+\/++\/S) is guaranteed, based on the current difficulty setting.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EHealing items (Tonic) \u0026amp; mutations (Necromancy, What doesn\u0027t kill me) now heal a percentage of your max life, and this percentage scales with your stats.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EElites enemies have been reworked. All of them will now have an additional random elite skill in addition of all their normal skills. Expect many different things, from lightning walls, clones or shield pylons.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Killing a mob while the homunculus is stuck on it no longer triggers the homunculus skill cooldown, allowing you to use constantly, as long as your target dies. If you recall it before the enemy death, it will trigger the penalty cooldown.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EThe Achievements are now visible ingame!\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EYou may now find Legendary Altars in some levels. They grant you a legendary item but you\u0027ll have to kill all the nearby enemies first. Version 1.1.2\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EFighter Endurance is a new mutation that increases your HP by a percentage which scales with your Brutality. Version 1.1.3\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EUpgrading items in Forge now costs a fixed flat price that doesn\u0027t scale with difficulty. Upgrading \u0026quot;from ++ to S\u0026quot; for example should now be more affordable in BC3 \u0026amp; BC4. Version 1.1.3\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EThe Homunculus will now retract if it touches traps like Spikes. Version 1.1.3\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EThe 5th money blueprint is now available ingame. Version 1.1.3\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion The way the player\u0027s HP scales has been vastly rebalanced for Brutality and Tactic. You should have much more HP at higher levels, preventing from being one-shot (if your build is balanced). \u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EBrutality used to give extra HP until level 14, it now caps at level 45 (30 for Tactic). Version 1.1.6\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion Increased HP given for each scroll you pick. The new values are +60% HP for Brutality, +50% HP for Tactic and +70% HP for Survival. Version 1.1.6\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ECommunity suggestion 3 shields are now Survival\/Tactic: Punishment, Parry Shield and Knockback Shield. Version 1.1.6\u003C\/p\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECommunity suggestion Electricity based weapons now deal critical hits if the target is standing in water.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Elite sidekicks mobs can no longer be grabbed by Homunculus\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Increased (a lot) Homunculus DPS\u003C\/li\u003E\n\u003Cli\u003EUsing the Homunculus now breaks invisibility\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion You can recall the homunculus when stuck on an enemy\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Fixed Homunculus enemy grab distance\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Pushing a grenade with a shield no longer triggers the \u0026quot;lock penalty timer\u0026quot; of the shield.\u003C\/li\u003E\n\u003Cli\u003EPushing grenades lying on the ground using the Parry Shield now properly creates additional bonus grenade.\u003C\/li\u003E\n\u003Cli\u003EMagnet grenade deals electric damage (crits in water)\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Countered bullets can now fly through walls if the countered bullet does.\u003C\/li\u003E\n\u003Cli\u003ECountered bullets now pierce first enemy.\u003C\/li\u003E\n\u003Cli\u003EPlayer Turrets no longer block enemy bullets.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Fixed elite Inquisitor wake distance (at last!)\u003C\/li\u003E\n\u003Cli\u003EHomunculus can now climb ladders.\u003C\/li\u003E\n\u003Cli\u003ECountered bullets will now go back to the enemy that sent it (yes, we\u0027re looking at you, Inquisitor!)\u003C\/li\u003E\n\u003Cli\u003EFixed Lightning Whip not dealing electricity damage in water\u003C\/li\u003E\n\u003Cli\u003EThe frontline shield (which won the \u0026quot;Most useless thing\u0026quot; award in 2017) has been updated. It can now be holded to grant invincibility, but this ability needs to be recharged (using parries or just waiting). It\u0027s no longer a zombie blueprint.\u003C\/li\u003E\n\u003Cli\u003EVampirism has been redesigned: it now causes bleeding to all nearby enemies and you get free healing when you kill them. It recharges when using your potion.\u003C\/li\u003E\n\u003Cli\u003ETonic recharges when using your healing potion. It\u0027s blueprint requirement was removed too, so it\u0027s available very early in any new game.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Partial hits (like the ones you get from blocking instead of parrying with a shield) no longer give you Infection markers.\u003C\/li\u003E\n\u003Cli\u003ESpiteful sword no longer stun enemies if the attack wasn\u0027t successful (eg. hitting a shield)\u003C\/li\u003E\n\u003Cli\u003EAdded and fixed scores on some monsters for Daily Run Mode\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Homunculus comes back to you if your main body gets hit.\u003C\/li\u003E\n\u003Cli\u003EFixed elites level\u003C\/li\u003E\n\u003Cli\u003ELegendary items rerolls at the Forge are now much more expensive, as expected.\u003C\/li\u003E\n\u003Cli\u003EBalanced refine\/reroll costs for most items at the Forge. S-tier items cost much more gold in the Forge.\u003C\/li\u003E\n\u003Cli\u003EIce Crossbow now has a much higher shooting rate but its range has been decreased.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Almost tripled the pickup distance of some precious rewards (gold teeth, gold cells etc.)\u003C\/li\u003E\n\u003Cli\u003ERemoved incompatible affixes for the Frantic Sword (like \u0026quot;moar damage when full life\u0026quot;).\u003C\/li\u003E\n\u003Cli\u003EThe Electric Whip has been updated: it deals more damage and has a 3-steps attack sequence.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion All gems are now automatically picked up as you walk past them.\u003C\/li\u003E\n\u003Cli\u003EPoison cloud now scales damage instead of giving damage reduction.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Shields no longer grant damage reduction. Parry damage has been increased for many of them.\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Combo\u0026quot; mutation deals much more damage but lasts less time.\u003C\/li\u003E\n\u003Cli\u003EVengeance mutation now reduces damage taken by a fixed percentage after getting hit.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion YOLO mutation now locks its mutation slot if it was consumed (you cannot remove it). You can still remove it if it wasn\u0027t used.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion You don\u0027t get any healing from food when you have the \u0026quot;Dead Inside\u0026quot; mutation.\u003C\/li\u003E\n\u003Cli\u003EIncreased damage reduction on \u0026quot;Tough Nut\u0026quot; mutation. It now grants you a move speed buff when you get hit by a trap.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion \u0026quot;Ripper\u0026quot; mutation now removes up to 3 arrows from enemy\u0027s body, dealing damage for each arrow.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion The \u0026quot;Melee\u0026quot; mutation lasts a little bit longer if the conditions are not met anymore (2 mobs or mob around you).\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion New perk reset costs (very cheap on first use, very expensive for all the next ones).\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Gastronomy\u0026quot; mutation now grants a DPS buff when you recycle food. This buff lasts 5 min and stacks. It still increases food efficiency if you eat it.\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Counter Attack\u0026quot; mutation deals almost twice more damage.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Cluster bombs spread much farther and each sub grenade deals more damage. It also has a slightly higher attack breach chance.\u003C\/li\u003E\n\u003Cli\u003EOil Grenade now applies oil on twice larger area, and it lasts longer.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Ice Bow now deals more damage but its freeze duration is now 0.5s. This weapon is meant to be an long-range \u0026quot;interrupt\u0026quot; weapon.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Fire grenade now scales its damage with the item level and no longer grants damage reduction.\u003C\/li\u003E\n\u003Cli\u003EThe Boomerang weapon now goes through all enemies, making it much easier to play. It no longer crits, but its damage were been increased accordingly.\u003C\/li\u003E\n\u003Cli\u003EYou may now drop a temporary \u0026quot;increased cell drops\u0026quot; bonus from enemies.\u003C\/li\u003E\n\u003Cli\u003EAffixes like \u0026quot;Shoot an arrow in front of you\u0026quot; or \u0026quot;Throw a grenade\u0026quot; can no longer interrupt enemy attacks.\u003C\/li\u003E\n\u003Cli\u003ENut Cracker no longer stuns enemies but deals critical strikes to frozen\/stun\/rooted enemies instead.\u003C\/li\u003E\n\u003Cli\u003EDoubled Spartan Sandal knockback power.\u003C\/li\u003E\n\u003Cli\u003ESwarm Grenade now invokes 2 minions but can be repeated to have up to 8 minions. It now has a 1 sec cooldown. Minions last much longer, and disappear if they are too far from you.\u003C\/li\u003E\n\u003Cli\u003EAlienation mutation now increases the number of enemies you have to kill by +50%\u003C\/li\u003E\n\u003Cli\u003EAcceptance mutation now inflicts Curses when you eat food.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Cursed Items no longer have a \u0026quot;+20% dmg taken\u0026quot; penalty (which never actually worked anyway, thanks to a bug). They are now always \u0026quot;++\u0026quot; tier and Colorless.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Increased Alchemic Gun attack speed (the DPS didn\u0027t change).\u003C\/li\u003E\n\u003Cli\u003EToxic Cloud is now an \u0026quot;acid\u0026quot; cloud that inflicts bleeding and poisoning. It lasts twice longer.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Elemental affixes (ie. \u0026quot;extra damage on fire\/bleed\/poison\u0026quot;) have been balanced. Fire got nerfed.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Sadism mutation was removed.\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Open wounds\u0026quot; is a new mutation that inflicts bleeding on every critical hits you deal to enemies.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion You can no longer use your Homunculus while cursed.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Pyrotechnics weapon deals less damage and has a slightly longer initial casting time.\u003C\/li\u003E\n\u003Cli\u003EFire Blast weapon description has been updated and its range has been increased.\u003C\/li\u003E\n\u003Cli\u003EOil disappears more quickly on burning enemies.\u003C\/li\u003E\n\u003Cli\u003EPunishment Shield deals more damage and repels + stuns nearby enemies.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Death Orb now explodes after a specific amount of damage dealt, or if the player is too far.\u003C\/li\u003E\n\u003Cli\u003ESlow-down effect after freezing now has a diminishing return limit (ie. it no longer works after X uses on the same enemy).\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion \u0026quot;Long Slow-down after freeze\u0026quot; affix now is 2x longer instead of 4x.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Lightning Bolt weapon can now be held beyond the overflow limit. You\u0027ll just take damage as long as you hold it.\u003C\/li\u003E\n\u003Cli\u003EDeath Orb no longer has a \u0026quot;rally effect\u0026quot; (recover recently lost HP).\u003C\/li\u003E\n\u003Cli\u003EFrost blast now has limited ammunition that automatically refills over time. It also has a slightly longer recovery time.\u003C\/li\u003E\n\u003Cli\u003EThe speed buff you get from killing enemies is now twice higher and lasts slightly longer.\u003C\/li\u003E\n\u003Cli\u003EThe Grappling Hook now adds a percentage based damage buff that scales with your stats and stuns the victim on your first attack.\u003C\/li\u003E\n\u003Cli\u003EPolished and balanced the Time Keeper! Will be more difficult to beat!\u003C\/li\u003E\n\u003Cli\u003EBalanced some item prices.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Spartan Sandal has a much faster casting time and now has a 3-steps attack sequence. The last attack ignores most knock-back resistances.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion The Rapier \u0026quot;crit window\u0026quot; lasts longer after a roll, allowing for more critical hits if you\u0027re fast enough.\u003C\/li\u003E\n\u003Cli\u003ERepeating Crossbow now roots enemies and has 4x more ammo. It inflicts critical hits to rooted targets.\u003C\/li\u003E\n\u003Cli\u003ERepeating Crossbow is now a Tactic\/survival weapon\u003C\/li\u003E\n\u003Cli\u003EIncreased quality level of all items in shops.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Reduced \u0026quot;extra damage on slowed down target\u0026quot; to 25%\u003C\/li\u003E\n\u003Cli\u003EFixed item duplication exploit.\u003C\/li\u003E\n\u003Cli\u003EBlood Sword bleed lasts much longer but inflicts less damage.\u003C\/li\u003E\n\u003Cli\u003EIncreased Hand of the King root resist. \u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion All the unused cells you have with you after you beat the Hand of the King will drop in a bag at the beginning of your next game, in the Prison.\u003C\/li\u003E\n\u003Cli\u003ESlightly increased Heavy Turret damage.\u003C\/li\u003E\n\u003Cli\u003EIncreased Powerful Grenade damage so it\u0027s now actually much more powerful. Its cooldown was decreased.\u003C\/li\u003E\n\u003Cli\u003EInfantry Grenade has a lower cooldown.\u003C\/li\u003E\n\u003Cli\u003EAdded \u0026quot;Bleed on parry\u0026quot; affix.\u003C\/li\u003E\n\u003Cli\u003EThe BroadSword now inflicts critical hits on 2nd \u0026amp; 3rd strikes.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Balanced Blade has almost no chance to interrupt enemy attacks (ie. stagger).\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Elite sidekicks no longer stop arrows. Version 1.1.1\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Boomerang can no longer receive \u0026quot;Ammo +3\u0026quot; affix. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Decreased Cudgel damage. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003ESpiteful sword now deals critical hits if you\u0027re cursed OR if you got hit up to 8 sec ago. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EAcceptance mutation now inflicts 5 curses when eating food. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EPrevented some affixes to be added to skills with very short cooldown (ie. Swarm). Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003ECorrupted Power cooldown was halved. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Bow \u0026amp; Endless Quiver\u0026quot; now deals more damage and inflicts a critical hit on last arrow. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EQuick Bow deals more dmg for critical hits and has 1 extra ammo. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EDuplex bow now shoots 3-arrows at a time and is considered a Tactic\/Survival weapon. It\u0027s slower, but deals more damage. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EDecreased Fire Grenade cooldown. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EDecreased Explosive Decoy cooldown. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EDecreased Lacerating Aura cooldown. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003EDecreased Wings of the Crow cooldown. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Dead Inside mutation now increases your HP by +50%. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Mobs attacked by the Homunculus will now aggro the hero in BC4. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Impaler spear now has knockback effect when hitting enemies. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003EInfantry Grenade now deals about twice more damage. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003EBeating the HotK is now rewarded with cells. Version 1.1.5\u003C\/li\u003E\n\u003Cli\u003EFire Turret cooldown is now twice shorter. Version 1.1.5\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Phazer cooldown was reduced. Version 1.1.5\u003C\/li\u003E\n\u003Cli\u003EWave of Denial is now twice more powerful, its cooldown is twice shorter and it can repel enemy bullets. Version 1.1.5\u003C\/li\u003E\n\u003Cli\u003ELacerating Aura can no longer interrupt (stagger) enemy attacks. Version 1.1.5\u003C\/li\u003E\n\u003Cli\u003ELacerating Aura has a shorter cooldown and a slightly larger area of effect. Version 1.1.6\u003C\/li\u003E\n\u003Cli\u003ELimited the frequency of scrolls on mobs. Version 1.1.6\u003C\/li\u003E\n\u003Cli\u003EFixed DashShield not properly stopping Thorny mobs when they roll over your face. Version 1.1.7\u003C\/li\u003E\n\u003Cli\u003EPunishment Shield inflicts damage to nearby enemies when blocking arrows or deflecting bombs. Its damage was slightly increased. Version 1.1.7\u003C\/li\u003E\n\u003Cli\u003EPlayer\u0027s diving attack no longer stuns enemies if they are under a full shield protection. Version 1.1.7\u003C\/li\u003E\n\u003Cli\u003EIce Shard weapon now throws 3 grenades at a time, is twice faster and slows down enemies for twice longer. Version 1.1.7\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EScrolls lying on the ground should no longer be too close from each others in levels.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Updated Roofs \u0026amp; Clock tower for speed runners.\u003C\/li\u003E\n\u003Cli\u003EAdded a connection between Prison Depths and Ancient Sewers that requires 1 activated boss cell.\u003C\/li\u003E\n\u003Cli\u003ESepulchre now has 5 triple scrolls and no doubles.\u003C\/li\u003E\n\u003Cli\u003EAncient Sewers now have 4 triple scrolls and no doubles.\u003C\/li\u003E\n\u003Cli\u003ECemetery lost 1 triple scroll.\u003C\/li\u003E\n\u003Cli\u003EAdded 3 boss-rune locked doors to Fog Fjord village.\u003C\/li\u003E\n\u003Cli\u003EAdded 2 boss-cell locked doors and a few extra stuff in Ancient Sewers.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Removed many rooms from Ancient Sewers to make it shorter.\u003C\/li\u003E\n\u003Cli\u003EMinor balance adjustments in Prison Depths.\u003C\/li\u003E\n\u003Cli\u003ERooms added for Ossuary and The promenade of the Condemned\u003C\/li\u003E\n\u003Cli\u003ENew traps added in secret portals!\u003C\/li\u003E\n\u003Cli\u003ETriggered doors now open almost instantly when walking on a pressure plate.\u003C\/li\u003E\n\u003Cli\u003EMinor level design fixes\u003C\/li\u003E\n\u003Cli\u003EAdded permanent lights near boss-cell locked doors in Sepulchre. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003ESpikes in the Throne room now retract after the HotK combat. Version 1.1.4\u003C\/li\u003E\n\u003Cli\u003ESewer rooms have been updated : the sewers are now narrower Version 1.1.7\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECommunity suggestion Lightning Bolt color feedback is now more legible.\u003C\/li\u003E\n\u003Cli\u003EThe forcefield wall fx (the one surrounding some bosses) has been updated \u0026amp; optimized\u003C\/li\u003E\n\u003Cli\u003EPause \u0026amp; map are now available in Homunculus mode\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Added cooldown feedbacks to homunculus skill (hero eye changes color)\u003C\/li\u003E\n\u003Cli\u003EFixed blood shield showing an area effect on blocking instead of on parrying only.\u003C\/li\u003E\n\u003Cli\u003EAdded a feedback to invite you to choose a item to replace\u003C\/li\u003E\n\u003Cli\u003ESome polishes on Pause and HUD: you can now see if an item is a colorless or legendary, and see what tier is used for it\u003C\/li\u003E\n\u003Cli\u003EFixed boss lifebar weird resizing\u003C\/li\u003E\n\u003Cli\u003ESome little UI fixes\u003C\/li\u003E\n\u003Cli\u003EBats position on ceil has been improved\u003C\/li\u003E\n\u003Cli\u003EPendulum can be tingled by bullets now.\u003C\/li\u003E\n\u003Cli\u003EAdded cell animation in Collector UI\u003C\/li\u003E\n\u003Cli\u003EImproved camera during Boss Battle\u003C\/li\u003E\n\u003Cli\u003EAdded a label in Save UI to know if these are from the Early Access.\u003C\/li\u003E\n\u003Cli\u003EClock Tower: fixed color doors and polish in background\u003C\/li\u003E\n\u003Cli\u003ECursed Treasure have now a background + the treasure color in the map\u003C\/li\u003E\n\u003Cli\u003EAdded various feedback on various UI window\u003C\/li\u003E\n\u003Cli\u003EAdded a fourth panel in GameInfos to show the current gameplay modifiers\u003C\/li\u003E\n\u003Cli\u003EYou can no longer access to superior forge rank if you don\u0027t have the required boss cells.\u003C\/li\u003E\n\u003Cli\u003EThe door behind the Guillain\u0027s Mutation shop now shows a better explanation if you try to open it while it\u0027s locked.\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Nerves of Steel\u0026quot; bow and \u0026quot;Boomerang\u0026quot; skins have been updated.\u003C\/li\u003E\n\u003Cli\u003EImproved a lot of UI for our mouse users!\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Updated some confusing translations (\u0026quot;victim burns\u0026quot;, etc)\u003C\/li\u003E\n\u003Cli\u003EFixed Hayabusa Gauntlets description.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Added a limit to the \u0026quot;critical hits\u0026quot; related screen flashing.\u003C\/li\u003E\n\u003Cli\u003EMade many cinematic animations (like teleporting, or crossing doors) a little bit faster.\u003C\/li\u003E\n\u003Cli\u003EAdded \u0026quot;Resist\u0026quot; feedback on mobs that can resist to all slow-down effects (ie. Hand of the King)\u003C\/li\u003E\n\u003Cli\u003EFixed Twin Daggers damage in its description.\u003C\/li\u003E\n\u003Cli\u003EWeapons that have unconditional critical hits (like Twin Dagger or Broadsword) now only show a single DPS value in their description. Version 1.1.2\u003C\/li\u003E\n\u003Cli\u003ELong-press feedback (like when recycling items) now shows up on top of everything. Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion You can now break hidden wall blocks using the \u0026quot;Activate\u0026quot; button\/key (useful if they are difficult to hit with your current weapons). Version 1.1.3\u003C\/li\u003E\n\u003Cli\u003ERemoved blood fx for critical hits on background props. Version 1.1.7\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EBug fixes\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EAmmo stuck on Hand of the King now drop if he jumps.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Fixed Hand of the King attack that did damage the player before the animation actually hits. It also no longer hits player if he\u0027s behind the boss on 3rd strike.\u003C\/li\u003E\n\u003Cli\u003EFixed Hand of the King issues with Bear Traps.\u003C\/li\u003E\n\u003Cli\u003ELightnings generated by an affix no longer hit nearby doors. \u003C\/li\u003E\n\u003Cli\u003EFixed Infection reset exploit during loading screens.\u003C\/li\u003E\n\u003Cli\u003EDirectX \u0026quot;device removed\u0026quot; errors are now handled correctly.\u003C\/li\u003E\n\u003Cli\u003EYou can now sell an item directly from a dual altar.\u003C\/li\u003E\n\u003Cli\u003EFixed crash after reloading a game during a Gameplay Twitch vote\u003C\/li\u003E\n\u003Cli\u003EOil Grenade now applies oil on its target properly, even if the target was already burning.\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Deflecting a grenade with a shield now properly triggers shield \u0026quot;on successful parry\u0026quot; effects (if they can apply), and it no longer locks player controls for 0.5s.\u003C\/li\u003E\n\u003Cli\u003EThe Hunter Grenade no longer has any gameplay affix.\u003C\/li\u003E\n\u003Cli\u003EAlly worms no longer attack doors\u003C\/li\u003E\n\u003Cli\u003EFixed bullets through walls exploit\u003C\/li\u003E\n\u003Cli\u003EHomunculus attacks can no longer be blocked by shields.\u003C\/li\u003E\n\u003Cli\u003EFixed multi activating item with one activate button push\u003C\/li\u003E\n\u003Cli\u003EThe Collector door will automaticaly open if you have nothing to unlock\u003C\/li\u003E\n\u003Cli\u003EFixed blueprints not showed in Collector UI the first time\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Fixed gastronomy mutation description\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUdate 1.0.2 (30 August 2018)\u003C\/h4\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed some mobs scoring points for score mode\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EImproved japanese translations\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EMods\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EImproved structure API to allow the creation of PrisonStart and PrisonRoof in scripts\u003C\/li\u003E\n\u003Cli\u003EFixed crash when trying to add buildTriggeredDoors in some cases\u003C\/li\u003E\n\u003Cli\u003EAdded createPerkShop\u003C\/li\u003E\n\u003Cli\u003EFixed some problem in call orders in scriptInterpreter\u003C\/li\u003E\n\u003Cli\u003EFixed some level parameter not reset correctly when changing level from a scripted one\u003C\/li\u003E\n\u003Cli\u003EFixed exception thrown when restarting a game with a mod (with a scripts) from the second level of a game with scripted mod\u003C\/li\u003E\n\u003Cli\u003EFixed wrong name set by script on exit when using something else than createSpecificExit\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed \u0026quot;IRC Command too long\u0026quot; (streaming mode)\u003C\/li\u003E\n\u003Cli\u003EFixed incorrect camera movement after frame drop\u003C\/li\u003E\n\u003Cli\u003EImproved music preloading\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 1.0 (7 August 2018)\u003C\/h4\u003E\n\u003Ch5\u003ELore\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe \u0026quot;lore\u0026quot; addition to the game is our first attempt at giving a little more information about the universe to players. You\u0027ll now encounter a bunch of random rooms as you explore the world, in them you\u0027ll find the inscriptions of former occupants, their corpses or maybe even the odd survivor.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EMod support improvement\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EWe really, really wish to push this forward and make sure you\u0027ve all the tools you need to make your own take on Dead Cells. As mentioned in a quick news recently, we greatly improved the mod support to give more freedom to our friend modders. However, it also means most of the previous mods won\u0027t work anymore. \u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe new additions include: \u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EYou can now create your own world design. For instance, let\u0027s say you think \u003Cem\u003EThe Remparts\u003C\/em\u003E should link to \u003Cem\u003EThe Clock Tower\u003C\/em\u003E, because it seems more coherent, well, now you can. This also allow you to plug in the current world design any custom level you may have done. Or create your own World Design with only custom levels. Your call! You can now create a custom level based on the parameters of an already existing level or set the parameters from scratch. When building it, you have the option of importing an pre-existing roaster of monsters from another level or make a mix. A new tool, the ScriptTool, will generate a default script with comments and basic exemples to get you going. \u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ETwitch Integration\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003E\n\u003Cp\u003EWe\u0027ve been beta testing with this feature for the past few weeks with the help of a few streamers. It\u0027s now live on the main branch for everyone. \u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003E\u003Cstrong\u003ECaptain Chicken\u003C\/strong\u003E: randomly chosen among willing viewers at the beginning of each level, he is in control of your health potion. When the player hit the heal button, \u003Cem\u003ECaptain Chicken\u003C\/em\u003E receives a whisper Twitch asking for a heal, which he can provide by writing \u0026quot;\u003Cem\u003Eheal\u003C\/em\u003E\u0026quot; in the chat. \u0026quot;\u003Cem\u003ENoheal\u003C\/em\u003E\u0026quot; allow to reject the request of the twitcher.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EBy default, \u003Cem\u003ECaptain Chicken\u003C\/em\u003E can also heal the player without any request, but it can be disabled. Finally, every words wrote in the general chat by this viewer starting with @[name of the twitcher] will appear in-game as if it was said by the bird. \u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003EIf the twitcher sends 3 healing requests without getting any response (\u003Cem\u003Eheal\u003C\/em\u003E or \u003Cem\u003Enoheal\u003C\/em\u003E), the chicken is reset, and another viewer can apply for this role. The viewer can also type \u0026quot;resign\u0026quot; to leave its role. As a failsafe, you can also manually banish the current\u003Cem\u003E Captain Chicken\u003C\/em\u003E from the menu, in the Twitch Integration settings.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003Cli\u003E\n\u003Cp\u003ETwitch Boss: A random viewer selected from those who volunteer will be able to add a bit of challenge during the boss fights by typing specific commands in the chat. Maybe consider disabling it if you\u0027re not quite comfortable with the combat yet.\u003C\/p\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EScrolls: Viewers choose between brutality, tactics, and survival.\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ETwitch Chest: Only viewers can open the chest, by writing \u0026quot;\u003Cem\u003Eboom\u003C\/em\u003E\u0026quot;, \u0026quot;\u003Cem\u003Epoke\u003C\/em\u003E\u0026quot; or \u0026quot;\u003Cem\u003Ebing\u003C\/em\u003E\u0026quot;, etc. in the chat\u003C\/li\u003E\n\u003Cli\u003EAmulets: Viewers can vote for a permanent upgrade to add to it between each level\u003C\/li\u003E\n\u003Cli\u003EGameplay modifiers: Between each level, viewers can vote to apply a gameplay modifier for the next level (enemies drop a bomb when dying, health began to drop after a while without killing an enemy, etc.) \u003C\/li\u003E\n\u003Cli\u003EI saw a secret!: Viewers can type \u0026quot;secret\u0026quot; in the chat to tell the player they spotted a secret thing on screen. Enable only when the player missed a secret. \u003C\/li\u003E\n\u003Cli\u003EPraise\/taunts: Viewers can praise or taunt the player on specific events (death, boss battles, timed doors, etc.)\u003C\/li\u003E\n\u003Cli\u003EDo it! or Nope: In specific situations, viewers can encourage (or not) the player to do special things, like opening a Cursed Chest.\u003C\/li\u003E\n\u003Cli\u003ENext level: Viewers can recommend a specific exit in the current level (like \u0026quot;sewer\u0026quot; or \u0026quot;roofs\u0026quot;). The player may or may not comply, depending on its equipments and own opinions :)\u003C\/li\u003E\n\u003Cli\u003ENew Sub: A new sub always deserves a little celebration!\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 0.9.3 [MAC] (18 July 2018)\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed crash on Mac with old CPU (before 2011)\u003C\/li\u003E\n\u003Cli\u003EMinor fixes related to mods \u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 0.9.2 (29 June 2018)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EMac and Linux builds are available\u003C\/li\u003E\n\u003Cli\u003Emod support\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Added experimental support for mods Version 0.9.2\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Add an option to enable the pixel art font (Options-\u0026gt;Video-\u0026gt;Pixelated Font)\u003C\/li\u003E\n\u003Cli\u003ECommunity suggestion Add an option to disable razer chroma\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\u003C\/li\u003E\n\u003Cli\u003EFixed Portuguese texts\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EUpdate 0.8.2 (5 June 2018)\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003ERestored Dicord rich presence support (fixed crash on Windows 7 during game exit)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch3\u003EUpdate 0.8.1 (5 June 2018)\u003C\/h3\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003E(Community suggestion) Added missing character for croatian translation\nUpdated japanese version\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EDisabled Discord rich presence support (will be re-enabled in a future update)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EThe Baguette Update (9 May 2018)\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EFull changelog available here: \u003Ca href=\u0022https:\/\/dead-cells.com\/patchnotes\u0022\u003Ehttps:\/\/dead-cells.com\/patchnotes\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EThe Hand of the King Update (06th Match 2018)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe Castle is a whole new level for you to explore, and die into.\u003C\/li\u003E\n\u003Cli\u003EA new final boss is now waiting for you at the end of the game. Be prepared for an epic battle! Note: \u0026quot;final\u0026quot; doesn\u0027t mean last fight boss planned in Dead Cells ;)\u003C\/li\u003E\n\u003Cli\u003EAll grenades items are now Brutality items first. Some of them can be dual-colored with Tactics or Survival.\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The hero HP scaling has been balanced. Points invested in Survival give more HP than points in Brutality, and these ones give more HP than points in Tactics. It\u0027s not a huge difference, but the idea is to make sure that Survival builds have a little bit more HP than Tactics for example.\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Dodging no longer cancels your weapon chained-attacks. For example, with a Broad Sword, this means that you can use the first 2 attack sequences from this weapon, roll, then use the 3rd attack sequence (the heaviest attack).\u003C\/li\u003E\n\u003Cli\u003EAdded new weapons \u0026amp; active skills, just because we could.\u003C\/li\u003E\n\u003Cli\u003EAdded a 4th difficulty level (using the new 4th boss cell): \u0026quot;Nightmare\u0026quot;. You get more cells but enemies are of course stronger. You don\u0027t have any healing flask refill AT ALL in this mode. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EAll the Boss Cells now only drop from the final boss! You get the 1st one when killing him for the first time. The 2nd one can be dropped from him in \u0026quot;Hard\u0026quot; difficulty level. The 3rd one is dropped in \u0026quot;Very hard\u0026quot; difficulty level and the last one in \u0026quot;Extreme\u0026quot; difficulty level. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The Fog Fjord level-design has been updated. The level is now almost two times smaller, the axe thrower mob has been removed, you will encounter less worms (but still a lot more than anywhere else) and its content has been updated (shops \u0026amp; treasures). Finally, worms have less HP now and their attack speed has been adjusted. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The Graveyard level design has been updated: the level is now almost two times shorter, teleporters locations are now more useful and less frequent and its content has been balanced (shops \u0026amp; treasures). Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The Sepulchre level design has been updated: the level is now shorter and its content has been balanced (nice treasures). Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EThe Ossuary has been updated: the level is now slightly shorter. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EThe Slumbering Sanctuary has been updated: it now contains different mobs at higher difficulty levels. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Extreme (3rd) and Nightmare (4th) difficulties now feature higher quality items. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The Wrenching Whip now deals a critical strike on last hit, but this last hit is now a kick instead of a whip attack. Its attack sequence is now also much faster. Version 0.6.3\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe Crusher skill is now Tactics\/Survival instead of Tactics\/Brutality\u003C\/li\u003E\n\u003Cli\u003EHeavy Turret is no longer a Survival skill.\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Golem can\u0027t teleport anymore you if you are invisible\u003C\/li\u003E\n\u003Cli\u003EThe Hokuto bow buff now deals more damage.\u003C\/li\u003E\n\u003Cli\u003EFlame thrower turret no longer burns mobs protected by a global shield.\u003C\/li\u003E\n\u003Cli\u003ERerolling shops is now more expensive and the number of rerolls has been reduced.\u003C\/li\u003E\n\u003Cli\u003EBear traps now properly apply their affixes to any trapped target. For example, a trap with \u0026quot;+100% damage on bleeding target\u0026quot;, will now make all your bleed-based attacks deal +100% damage on a trapped victim.\u003C\/li\u003E\n\u003Cli\u003EFire \u0026amp; poison AoE now apply to mobs more frequently (so for example, this means a little bit more damage if the target mob stays over a platform on fire, or in a poison cloud)\u003C\/li\u003E\n\u003Cli\u003EThe quick-fire turret is now a Dual Turret that shoots 2 arrows at different targets at the same time. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EThe heavy turret damage has been doubled. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EThe fire turret DoT damage has been increased. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EAdded a new mutation that gives you extra +30% HP. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The Lightning Whip now ignore shields Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EThe Punishment shield no longer deals twice damage on a parried target. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Death orb no longer explodes when blocked by a shield. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EDeath orb gets even slower when it deals damage to something. This means moar damage to its victim. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EPhaser skill now inflicts a fixed amount of damage which scales instead a fixed percentage that didn\u0027t scale. It\u0027s also now possible to have many random affixes like \u0026quot;Poison the victim\u0026quot; on it. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] It\u0027s now possible to have 2 Death Orbs at the same time if you do have 2 distinct skills equipped. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003EFire Torrent weapon now inflicts Critical Hits on oiled targets Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] When a grenade is repeled by a shield or another skill, it will now apply the source item affixes properly to the victim on explosion. For example, a shield with \u0026quot;Poison the victim\u0026quot; affix will now poison enemies hit by a repeled grenade. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003EGrappling Hook skill is now Tactics \u0026amp; Survival. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Grappling Hook now applies a flat damage bonus on next attack which scales properly with your tiers. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003EPhaser skill now apply its damage buff only to the victim of the skill. Version 0.6.2\u003C\/li\u003E\n\u003Cli\u003EThe amount of cells you get from Ancient Temple cell shrines is now much much lower. Version 0.6.3\u003C\/li\u003E\n\u003Cli\u003EFire torrent weapon no longer burns the ground behind walls. Version 0.6.3\u003C\/li\u003E\n\u003Cli\u003EThe Kunai weapon no longer auto-aim enemies behind you Version 0.6.5\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Community suggestion] Added new \u0026quot;dual treasures\u0026quot; in some levels. These are similar to the daily mode treasures: you have to choose between a weapon and an active skill, and the other item disappears.\u003C\/li\u003E\n\u003Cli\u003EAdded new secret areas. Somewhere.\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The corridor at the end of the Promenade is now a little bit shorter.\u003C\/li\u003E\n\u003Cli\u003EAdded many 4-boss-cells doors everywhere. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003ECursed Treasure in Old Sewers is not 100% guaranteed anymore. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003ENew rooms added in \u0026quot;The Prisoner\u0027s Cells\u0026quot; Version 0.6.2\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Community suggestion] If you have the YOLO perk equiped and reset your perks at Guillain\u0027s shop, you now are able to equip again the YOLO perk in this particular shop.\u003C\/li\u003E\n\u003Cli\u003EFixed Quick Bow animation.\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] Added a small explanation on diet menu.\u003C\/li\u003E\n\u003Cli\u003EIt\u0027s no longer possible to accidentally heal multiple times quickly having \u0026quot;Emergency triage\u0026quot; perk equipped and holding the heal button.\u003C\/li\u003E\n\u003Cli\u003EFixed UI text align in many different places Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EFixed the damage shown on shields description (it now scales properly with the item quality). This was only a display bug, the real damage were right. Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EUpdated the Death Orb fx Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EUpdated the crossbow weapon animation Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EFixed dabbing Phaser mob Version 0.6.5\u003C\/li\u003E\n\u003Cli\u003EFixed dabbing Spinner mob Version 0.6.5\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EMusic \u0026amp; Sfx\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EA lot of new missing SFXs have been added\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECrow wings no longer triggers the counter attack of the Thorny mobs\u003C\/li\u003E\n\u003Cli\u003EPerk \u0026amp; collector NPCs no longer require to \u0026quot;kill all nearby enemy first\u0026quot;\u003C\/li\u003E\n\u003Cli\u003ERemove useless teleporter in Top Clock Tower\u003C\/li\u003E\n\u003Cli\u003EEnemies no longer walk in spikes by themselves\u003C\/li\u003E\n\u003Cli\u003EPurple link between meta teleporters in the minimap no longer disappear when you pass through a portal\/zdoor\u003C\/li\u003E\n\u003Cli\u003EFixed some issues with mobs pushing themselves in the self direction when reaching the border of a platform.\u003C\/li\u003E\n\u003Cli\u003EFixed Merchant position when you have unlocked Shop Rerolls \u0026amp; Shop Categorizations Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EFixed crash in Stats Panel Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EFixed the Pyrotechnics hit detection Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003E[Community suggestion] The auto-aim feature on melee weapons have been tweaked a little bit to avoid illogical turnaround in specific situations (for example with the Phaser skill). Version 0.6.1\u003C\/li\u003E\n\u003Cli\u003EFixed a crash with Poison Cloud item affix Version 0.6.3\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EPatch 0.5.12 (10th January 2018)\u003C\/h4\u003E\n\u003Ch5\u003EChristmas \u0026quot;gifts\u0026quot; have disappeared. For now.\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EOil bomb blueprint now drops from giant mechanical spider\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Community Suggestion] Double damage affix now inflicts x2 to hero instead of x3\u003C\/li\u003E\n\u003Cli\u003EQuad damage affix now makes items more expensive\u003C\/li\u003E\n\u003Cli\u003ECursed sword can no longer get quad damage affix\u003C\/li\u003E\n\u003Cli\u003E[Community Suggestion] Active skills can now receive Double damage affix\u003C\/li\u003E\n\u003Cli\u003E[Community Suggestion] Golem can\u0027t teleport you anymore if you are invisible\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed an impossible room in Fog Fjord interiors\u003C\/li\u003E\n\u003Cli\u003E[Community Suggestion] Removed scrolls from meta locked area in Promenade\u003C\/li\u003E\n\u003Cli\u003ELoots like scrolls should no longer spawn on \u0026quot;unstable platforms\u0026quot; (ie. platforms that open under your feet)\u003C\/li\u003E\n\u003Cli\u003EBells in Clock Tower should no longer spawn in unreachable area\u003C\/li\u003E\n\u003Cli\u003ESecrets in walls should no longer be right near another one\u003C\/li\u003E\n\u003Cli\u003EFixed missing scrolls in Promenade \u0026amp; Sepulchre\u003C\/li\u003E\n\u003Cli\u003ERemoved useless teleporters behind Ancient Temple boss doors\u003C\/li\u003E\n\u003Cli\u003EFixed empty crypts in Cemetery\u003C\/li\u003E\n\u003Cli\u003EYou now need 3 boss cells to open the shortcut to the Watcher\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed hero wall run animation\u003C\/li\u003E\n\u003Cli\u003EFixed Beginner\u0027s bow animation timing\u003C\/li\u003E\n\u003Cli\u003EFixed food description when Gastronomy mutation is equiped\u003C\/li\u003E\n\u003Cli\u003EFixed flipped item icons\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EIt\u0027s no longer possible to throw grenades through walls\u003C\/li\u003E\n\u003Cli\u003EFixed hero curse label not disappearing during exit cinematic\u003C\/li\u003E\n\u003Cli\u003EFixed ExplosiveCrossBow: damage now scale properly and all its weapon affixes should work as expected\u003C\/li\u003E\n\u003Cli\u003EFixed rats walking on broken grounds\u003C\/li\u003E\n\u003Cli\u003EPrevented Teleporters from opening too early in specific conditions\u003C\/li\u003E\n\u003Cli\u003EFixed timed doors wrong message\u003C\/li\u003E\n\u003Cli\u003EFixed volume sliders in Options\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EPatch 0.5.11.1 (05 January 2018)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EWe fixed incorrect HP values displayed in the window that shows up when you pick a scroll. Previously, successive scrolls would give +50% HP, +45% HP, +40% HP etc. -\nFixed display now shows +50% HP, +30% HP, +21% HP etc. Dont worry: the \u0026quot;new\u0026quot; HP values may seem lower BUT the actual gameplay values were not changed at all. We only fixed an incorrect display. \u003C\/li\u003E\n\u003Cli\u003E(Community suggestion) Hunter\u0027s Grenade can now transmute enemies even if they don\u0027t have an Elite version. In such a case, they turn into Elite Zombies. \u003C\/li\u003E\n\u003Cli\u003E(Community suggestion) Hunter\u0027s Grenade now extracts a relevant blueprint from the target enemy if you already carry other blueprints in your bag.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EMeat Grinder and Heavy Grenade are now Brutality skills too in addition of Tactics\u003C\/li\u003E\n\u003Cli\u003ETriggering the YOLO mutation now stops poisoning on the player\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed Ligament Slicer displayed as having limited ammo \u003C\/li\u003E\n\u003Cli\u003EFixed rooms in the \u0026quot;Fog Fjord\u0026quot; (keys are now reachable)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EPatch 0.4.7 (16 November 2017)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EYou can now see a link between 2 mini teleporter in the sepulchre once you use one of them\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EFixed crash on OrbLauncher Orb\u003C\/li\u003E\n\u003Cli\u003EFixed when you go underground during Assassin\u0027s fight.\u003C\/li\u003E\n\u003Cli\u003EFixed camera lock during homunculus cinematic\u003C\/li\u003E\n\u003Cli\u003EFixed localization\u003C\/li\u003E\n\u003Cli\u003ESome other minor fixes\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EPatch 0.4.6 (15th November 2017)\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EAdded the possibility to skip on some cinematic\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ECommunity suggestion Collector door is less resistant.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ENew rooms added for the Ram\u0027s rune, and improvements \/ bug fixes for the existing rooms.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EAdded icons on minimap for Ancient Temple Switch, Door, etc...\u003C\/li\u003E\n\u003Cli\u003EModify the Flasks\u0027 color in the Prison Start according to new upgrade system\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Chr \/\u003E\n\u003Ch4\u003EPatch 0.4.5-2017-11-13 - a1c7c194 - GOG (14 November 2017)\u003C\/h4\u003E\n\u003Ch5\u003EImportant features\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EDive attack has been rebalanced. The Rune now grants more damage and larger area of effect.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBalancing\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003ERetaliation affix should no longer deal huge amount of damage. It now deals all damage received x3 to the attacker.\u003C\/li\u003E\n\u003Cli\u003EColorless items now augment all damage you receive, instead of having lower damage.\u003C\/li\u003E\n\u003Cli\u003EBroadsword hit box has been fixed. Only the third attack should hit enemies behind you.\u003C\/li\u003E\n\u003Cli\u003EInfantry bow has a little bit more ammo.\u003C\/li\u003E\n\u003Cli\u003ESmall grenades should now work properly on the Watcher boss\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ELevel design\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EBalanced all timed doors.\u003C\/li\u003E\n\u003Cli\u003EBalanced Prison Depths difficulty.\u003C\/li\u003E\n\u003Cli\u003ERework of rooms designed for the Ram\u0027s Rune.\u003C\/li\u003E\n\u003Cli\u003EFixed kitchen shops music\u003C\/li\u003E\n\u003Cli\u003E(Community suggestion) Added timed doors to Fjord village \u0026amp; Cemetery\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EGraphics \u0026amp; UI\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EColorless items now appear with a white halo when dropped on the ground\u003C\/li\u003E\n\u003Cli\u003EThe orb of the orb Launcher has been imrpoved\u003C\/li\u003E\n\u003Cli\u003EElevators skin has been updated\u003C\/li\u003E\n\u003Cli\u003EUpdated Orb Caster attack\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EBug fixes\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EWorms from the Fog Fjord are not stunned anymore by DoT damage.\u003C\/li\u003E\n\u003Cli\u003EMany minor bug fixes\u003C\/li\u003E\n\u003Cli\u003EMany crash fixes\u003C\/li\u003E\n\u003Cli\u003E\u0026quot;Freeze on parry\u0026quot; shield affix now works properly\u003C\/li\u003E\n\u003Cli\u003ETracker mobs from the Sepulchre attack animation has been fixed\u003C\/li\u003E\n\u003C\/ul\u003E","forumLink":"https:\/\/embed.gog.com\/forum\/dead_cells","isBaseProductMissing":false,"missingBaseProduct":null,"features":["Achievements","Cloud saves","Overlay"],"simpleGalaxyInstallers":[{"path":"\/downloads\/dead_cells\/531ac63327842197b1eaa22b85c367cb","os":"windows"},{"path":"\/downloads\/dead_cells\/248c254e2e573029b30f95cece0905ad","os":"mac"}]}